{
  "name": "Lucas Bernardo de Souza Santos",
  "avatar": "images/profile/lucassouza_profile.png",
  "background": "background.jpg",
  "title": "Desenvolvedor Full Stack Sênior",
  "about": "Sou um <b>Desenvolvedor Full Stack Sênior com mais de 10 anos de experiência</b> em todos os estágios do ciclo de desenvolvimento. Tenho prática em desenvolvimento de software, criação de frameworks, integração entre sistemas, mentoria para desenvolvedores e identificação de talentos em desenvolvimento.<br>Com ensino superior concluído na Universidade Tecnológica Federal do Paraná (<b>UTFPR</b>), possuo conhecimento de arquitetura de software e desenvolvimento, incluindo <b>Java, JavaScript, Delphi, HTML5, JSON, XML, MySQL, Microsoft SQLServer, JQuery, Node.js e AngularJS. Também possuo experiência em gestão e liderança.</b>",
  "contact": {
    "email": "sorackb@gmail.com",
    "website": "lucassouza.ninja",
    "skype": "sorackb",
    "phone": "+55 (42) 99949-3924",
    "place": "Florianópolis / SC - Brasil",
    "stackoverflow": "https://pt.stackoverflow.com/users/59479/sorack?tab=profile",
    "facebook": "https://www.facebook.com/lucasbss",
    "google_plus": "https://plus.google.com/u/1/105353010340963385077",
    "linkedin": "https://www.linkedin.com/in/lucas-bernardo-de-souza-santos/",
    "github": "https://github.com/sorackb"
  },
  "education": [
    {
      "icon": "fa-flask",
      "title": "Educação Preparatória",
      "institution": "Colégio Adventista de Interlagos",
      "period": "1997 - 2002",
      "description": "Obtive a base para meus estudos antes do Ensino Médio, valorizando o estudo e o aprendizado e adquirindo afinidade com o conhecimento."
    },
    {
      "icon": "fa-book",
      "title": "Ensino Médio",
      "institution": "Colégio Adventista de Interlagos",
      "period": "2003 - 2005",
      "description": "Completei a preparação para o vestibular nesta instituição que possue, além de todos os méritos acadêmicos, um compromisso com a educação ética."
    },
    {
      "icon": "fa-cogs",
      "title": "Mecânico de Usinagem",
      "institution": "SENAI Ary Torres",
      "period": "2003 - 2005",
      "description": "Qualificação profissional em processos de usinagem com máquinas convencionais e a comando numérico computadorizado (CNC).<br>Neste curso com duração de 4 semestres obtive destaque em nota em todos os semestres, sendo prestigiado assim com certificados emitidos pela instituição.<br>Aprendi a administrar o tempo de estudo realizando o curso no contraturno do Ensino Médio."
    },
    {
      "icon": "fa-graduation-cap",
      "title": "Tecnologia em Análise e Desenvolvimento de Sistemas",
      "institution": "Universidade Tecnológica Federal do Paraná",
      "period": "2013 - 2017",
      "description": "Formação profissional para a atuação em desenvolvimento tecnológico em informática, com ênfase em desenvolvimento de sistemas de informação, utilizando as modernas tecnologias da informação. Capacitação para adaptar-se às mudanças sociais e à evolução tecnológica, possibilitando uma constante atualização nas diversas tarefas e qualificações que o mundo do trabalho exige.<br>Algumas atividades que às quais o curso habilita são: programação em linguagem comercial e científica, operação e manutenção de sistemas de computadores, supervisão e orientação do trabalho de equipes de tecnologia de informação, análise e orientação de computação eletrônica, chefia nas áreas de tecnologia de informação, elaboração de manuais e documentos de sistemas, implantação e gerência de redes de teleprocessamento."
    },
    {
      "icon": "fa-university",
      "title": "Especialização - Arquitetura de Software Distribuído",
      "institution": "Pontifícia Universidade Católica de Minas Gerais",
      "period": "2019 - 2021",
      "description": "O curso foi concebido de modo a buscar o preenchimento de uma lacuna na formação avançada dos profissionais de informática que atuam na concepção, construção e implantação de sistemas de informação que usam aspectos de arquitetura de software distribuído. O curso justifica-se pela crescente adoção de tecnologias e padrões baseados na Internet, pela demanda por aplicações em dispositivos móveis bem como pela necessidade de armazenamento, processamento e integração de grandes volumes de informação que têm incentivado a proliferação de sistemas de informação desenvolvidos em arquiteturas distribuídas. Em particular, destacam-se o crescimento da demanda por aplicações móveis, o fenômeno da computação em nuvem (cloud computing), o uso da Arquitetura Orientada a Microsserviços, as diversas alternativas para integração de aplicações e novas arquiteturas para tratamento do conceito de Big Data."
    }
  ],
  "experience": [
    {
      "title": "Aprendiz",
      "company": "Carbono Lorena",
      "period": "2003 - 2005",
      "description": "Fui aprendiz de usinagem industrial em paralelo com meus estudos no SENAI, programando para <b>CNC (Comando Numérico Computadorizado)</b> e acompanhando a linha de produção de peças de grafite."
    },{
      "title": "Estagiário de Informática",
      "company": "ABO - Associação Brasileira de Odontologia",
      "period": "2006 - 2007",
      "description": "Realizei trabalhos de monitoramento e manutenção da estrutura de computadores da Associação Brasileira de Odontologia em Ponta Grossa. Auxiliei usuários na utilização dos computadores e sistemas para funcionamento do orgão e manutenção do site que estava no ar durante este período.<br>Criei também um sistema de controle de patrimônio em <b>Delphi</b> e um sistema de auxílio para o evento realizado a cada 2 anos pela instituição."
    },
    {
      "title": "Estagiário de Informática",
      "company": "Colégio Sepam",
      "period": "2007 - 2008",
      "description": "Auxiliei na manutenção dos equipamentos de informática e implantei o processo de gerenciamento de computadores e softwares que garantiu a melhor utilização dos recursos e economia de tempo com relação às máquinas disponíveis no colégio."
    },
    {
      "title": "Estagiário de Desenvolvimento",
      "company": "Quantoon",
      "period": "2008 - 2009",
      "description": "Iniciei minha carreira em desenvolvimento aqui, tendo contato com diferentes tecnologias visando o controle de enxoval de grandes lavanderias.<br>Trabalhei com RFID, porta serial e outras ferramentas que tinham como objetivo facilitar o rastreamento e processamento dos objetos."
    },
    {
      "title": "Desenvolvedor Full Stack Pleno",
      "company": "KMM Engenharia de Sistemas",
      "period": "2009 - 2011",
      "description": "Trabalhei principalmente em um sistema ERP com foco em soluções logísticas e de armazenagem.<br>Mantive o foco em refatorar partes críticas do sistema possibilitando assim a fácil manutenção e reutilização de código.<br>Trabalhei junto a alguns clientes para reunir requisitos e realizar manutenções críticas em módulos com ampla utilização."
    },
    {
      "title": "Desenvolvedor Full Stack Sênior",
      "company": "Virtual Softwares para Seguros",
      "period": "2012 - 2017",
      "description": "Criei e mantive aplicações, bibliotecas e frameworks para automatizar e gerenciar informações para corretores de seguros.<br>Pesquisei novas tecnologias que melhor se adequassem aos objetivos dos sistemas.<br>Dei suporte técnico para problemas emergenciais, garantindo a resolução com qualidade no melhor tempo possível.<br>O banco de dados utilizado predominantemente foi o <b>Microsoft SQL Server</b> enquanto uma diversidade muito maior de linguagens e frameworks foi aprendida e aplicada.<br>Realizei manutenção nos sistemas já existentes em <b>Delphi, Dojo Toolkit e C#</b> no backend da aplicação Web.<br>Criei ferramentas de integração e obtenção de dados em <b>Java</b> e a base do novo sistema Web utilizando <b>AngularJS e Node.js</b>."
    },
    {
      "title": "Backend Software Developer",
      "company": "Softplan",
      "period": "2019 - 2020",
      "description": "Mantenedor da aplicação de integração com as Secretarias da Fazenda de diversos Estados e Municípios, provendo soluções para os problemas comuns à integração e propondo alteração em relação a arquitetura da aplicação e infraestrutura. Além disso atuar como solucionador de problemas através da criação e utilização efetiva de ferramentas de apoio visando a economia de tempo e automatização de tarefas do setor de procuradorias.<br><br>Linguagens de programação / Frameworks:<br><br>Java - Maven / JBoss / Spring Boot<br><br>Banco de Dados: Oracle e Microsoft SQL Server."
    },
    {
      "title": "Full Stack Developer",
      "company": "Softplan",
      "period": "2020 - 2020",
      "description": "Mantive e implementei aplicações juntamente com o time de integração, utilizando hooks para a aplicação Node.js e um portal desenvolvido em React.<br><br>Linguagens de programação / Frameworks:<br><br>Node.js / React<br>Banco de Dados: MongoDB"
    },
    {
      "title": "Software Developer",
      "company": "everis",
      "period": "2020 - Atual",
      "description": "Desenvolvi funcionalidades atuando na equipe responsável pelo projeto do portal da Enel do Ceará, Goiás e Rio de Janeiro, realizando integrações com ERPs SAP, Salesforce, etc.<br><br>Linguagens de programação / Frameworks: AEM / Java"
    }
  ],
  "interest": {
    "text": "Em primeiro lugar eu adoro assistir séries e filmes. Amo jogar videogame e jogos eletrônicos com meus amigos. Gosto muito de dirigir e me sinto feliz quando estou viajando. Além disso, apesar de também trabalhar com isso, amo programar, mesmo no meu tempo livre.",
    "icons": {
      "one": {"icon": "fa-television", "text": "Séries"},
      "two": {"icon": "fa-gamepad", "text": "Jogos"},
      "three": {"icon": "fa-film", "text": "Filmes"},
      "four": {"icon": "fa-plane", "text": "Viagens"},
      "five": {"icon": "fa-car", "text": "Dirigir"},
      "six": {"icon": "fa-keyboard-o", "text": "Programação"}
    }
  }
}